# Creating DataFrame

In [1]:
# Loading libraries
import pandas as pd

In [2]:
# Create DataFrame
df = pd.DataFrame()
df['Name']  = ['Tu', 'Yo', 'Your mother']
df['Age']   = [30,29,60]
df['Smoker']= [True, False, True]

df.head()

          Name  Age  Smoker
0           Tu   30    True
1           Yo   29   False
2  Your mother   60    True

### Add value to rows

In [3]:
import pandas as pd

In [4]:
### Create a new person/row
ds = pd.DataFrame(columns = ['Primera','Segunda'])
ds = ds.append(pd.Series(['a', 'b'], index = ['Primera', 'Segunda']), ignore_index = True)
ds = ds.append(pd.Series(['e','f'] , index = ['Primera', 'Segunda']), ignore_index = True)
ds

  Primera Segunda
0       a       b
1       e       f

In [5]:
e = str(ds.shape)
e

'(2, 2)'

In [6]:
print('La shape de ds es : ' + "\n" + e)

La shape de ds es :
(2, 2)

# Navigating DataFrames

In [7]:
# Load library
import pandas as pd

In [8]:
# Selecting URL
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [9]:
# Reading csv and print result
df = pd.read_csv(url)
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [10]:
# Getting shape
df.shape

(1313, 6)

In [11]:
no_changes = df

In [12]:
# Selecting first element
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [13]:
# Selecting second,third and fourth element
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [14]:
# Selecting from the first until fith element
df.iloc[:5]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

### Change index 
Now it is possible to access rows with the name of the passenger

In [15]:
df = df.set_index(df['Name'])
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [16]:
df.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [17]:
df.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

### Select Rows based on conditionals

In [18]:
df[(df['Sex']=='female') & (df['Age'] >= 60)]
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0

### Replace values

Switching Female values for Woman

In [19]:
df['Sex'].replace('male','sipollico').head(5)

Name
Allen, Miss Elisabeth Walton                        female
Allison, Miss Helen Loraine                         female
Allison, Mr Hudson Joshua Creighton              sipollico
Allison, Mrs Hudson JC (Bessie Waldo Daniels)       female
Allison, Master Hudson Trevor                    sipollico
Name: Sex, dtype: object

In [20]:
# Replacing two values at the same time

df['Sex'].replace(['female', 'male'],['chochito','sipollico']).head(5)

Name
Allen, Miss Elisabeth Walton                      chochito
Allison, Miss Helen Loraine                       chochito
Allison, Mr Hudson Joshua Creighton              sipollico
Allison, Mrs Hudson JC (Bessie Waldo Daniels)     chochito
Allison, Master Hudson Trevor                    sipollico
Name: Sex, dtype: object

In [21]:
# Replacing across all the dataset

df = df.replace('1st','Business').head(5)
df

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",Business,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",Business,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",Business,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",Business,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",Business,0.92,male,1,0

In [22]:
df = df.replace(['female','male'],['chochito','sipollico'])
df

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",Business,29.00,chochito,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",Business,2.00,chochito,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",Business,30.00,sipollico,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",Business,25.00,chochito,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",Business,0.92,sipollico,1,0

### Renaming Columns

In [23]:
df = df.rename(columns={'PClass':'Estirpe'}).head(5)
df

,Name,Estirpe,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",Business,29.00,chochito,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",Business,2.00,chochito,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",Business,30.00,sipollico,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",Business,25.00,chochito,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",Business,0.92,sipollico,1,0

In [24]:
#Import library
import collections

In [25]:
column_names = collections.defaultdict(str)

In [26]:
# Create Keys
for name in df.columns:
    column_names[name]
    
column_names

defaultdict(str,
            {'Age': '',
             'Estirpe': '',
             'Name': '',
             'Sex': '',
             'SexCode': '',
             'Survived': ''})

### Finding Max,Min,Sum,Average and Count

In [27]:
# Calculate statistics
print('Maximum:',no_changes['Age'].max())
print('Minimum:',no_changes['Age'].min())
print('Mean:',   no_changes['Age'].mean())
print('Sum:',    no_changes['Age'].sum())
print('Count:',  no_changes['Age'].count())
print('Standard Desviation', no_changes['Age'].std())
print('Kurtosis:',no_changes['Age'].kurt())
print('Skewness:',no_changes['Age'].skew())
print('Standard Mean Error:',no_changes['Age'].sem())
print('Moda:',   no_changes['Age'].mode())
print('Mediana:',no_changes['Age'].median())

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989415
Sum: 22980.879999999997
Count: 756
Standard Desviation 14.259048710359023
Kurtosis: -0.0365361689247
Skewness: 0.368510873716
Standard Mean Error: 0.518596587724
Moda: 0    22.0
dtype: float64
Mediana: 28.0

In [28]:
# Note that we have reducted the df to 5 observations. You can detect a statistic for the whole df
no_changes.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

### Finding Unique values

In [29]:
no_changes['Sex'].unique()

array(['female', 'male'], dtype=object)

In [30]:
no_changes['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [31]:
no_changes['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [32]:
no_changes['PClass'].nunique() # There is one passenger with a different tag

4

### Handling Missing Values

In [33]:
no_changes[no_changes['Age'].isnull()].head(5)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

### Deleting columns

axis = 0 ==> rows   |||||||||||||||||||||||||
axis = 1 ==> columns

In [34]:
no_changes.drop(['Sex'], axis = 1).head(5)

,Name,PClass,Age,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,1,0

In [35]:
# Drop two columns
no_changes.drop(['Sex','PClass'],axis=1).head(5)

                                            Name    Age  Survived  SexCode
0                   Allen, Miss Elisabeth Walton  29.00         1        1
1                    Allison, Miss Helen Loraine   2.00         0        1
2            Allison, Mr Hudson Joshua Creighton  30.00         0        0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  25.00         0        1
4                  Allison, Master Hudson Trevor   0.92         1        0

In [36]:
no_changes.drop(no_changes.columns[0], axis = 1).head(5)

  PClass    Age     Sex  Survived  SexCode
0    1st  29.00  female         1        1
1    1st   2.00  female         0        1
2    1st  30.00    male         0        0
3    1st  25.00  female         0        1
4    1st   0.92    male         1        0

### Deleting Rows

In [37]:
# Deleting all men
no_changes[no_changes['Sex'] != 'male'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [38]:
# Deleting first two rows with drop
no_changes.drop([0,1], axis= 0).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1

In [39]:
# Deleting rows with a certain name
no_changes[no_changes['Name'] != 'Anderson, Mr Harry'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [40]:
# Delete first row
no_changes[no_changes.index != 0].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

### Deleting duplicate rows

In [41]:
no_changes.drop_duplicates().head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [42]:
print('Number of rows of the original df', len(no_changes))
print('Number of rows after deduping', len(no_changes.drop_duplicates()))

Number of rows of the original df 1313
Number of rows after deduping 1313

#### This is not deleting any row because all of them are unique. They must match perfectly in all columns to be dropped

### Subset
Subseting columns to check duplicated rows

In [43]:
no_changes.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [44]:
no_changes.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

### Groping Rows by Value

In [45]:
# Import library
import pandas as pd

In [46]:
# Creating URL
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [47]:
# Creating dataframe
df = pd.read_csv(url)

In [48]:
# Group rows by values of the column "Sex", calculate mean of each group
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

### Groupby

In [49]:
# Group row & calculate mean [MANDATORY : groupby + function]
df.groupby('Survived').count()

          Name  PClass  Age  Sex  SexCode
Survived
0          863     863  443  863      863
1          450     450  313  450      450

In [50]:
# Group survived or not and count the numbers of names in each group
df.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [51]:
df.groupby(['Sex','Survived']).count()

                 Name  PClass  Age  SexCode
Sex    Survived
female 0          154     154   71      154
       1          308     308  217      308
male   0          709     709  372      709
       1          142     142   96      142

In [52]:
# Group by column and then for a nother column
df.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

### Group Rows by time
Group individuals rows by time periods

In [53]:
# Import libraries
import numpy as np 
import pandas as pd

In [54]:
# Create data range 
time_index = pd.date_range('04/06/1989', periods =100000, freq = '30S')

In [55]:
# Creade dataframe
df = pd.DataFrame(index = time_index)

In [56]:
# Create column of random values
df['Sales_Amount'] = np.random.randint(1,10,100000)

In [57]:
# Calculate rows by week
df.resample('W').mean()

            Sales_Amount
1989-04-09      5.011198
1989-04-16      4.987202
1989-04-23      5.004216
1989-04-30      4.973710
1989-05-07      5.006200
1989-05-14      4.953061

In [58]:
df.resample('2W').mean()

            Sales_Amount
1989-04-09      5.011198
1989-04-23      4.995709
1989-05-07      4.989955
1989-05-21      4.953061

In [59]:
# Group by month
df.resample('M').count()

            Sales_Amount
1989-04-30         72000
1989-05-31         28000

In [60]:
# Group by month, count rows 
df.resample('M', label='left').count()

            Sales_Amount
1989-03-31         72000
1989-04-30         28000

### Looping Over a Column
Iterate over every element in a column and apply some action

In [61]:
# Import library
import pandas as pd

In [62]:
# Generate url
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [63]:
df = pd.read_csv(url)

### Bucle FOR:

In [64]:
# Print two names uppercased
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

### List Comprehensions

In [65]:
[name.upper() for name in df['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

### Applying a function over all elements in a column
Using apply

In [66]:
# Import library
import pandas as pd

In [67]:
# Generate url
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [68]:
# Create df
df = pd.read_csv(url)

In [69]:
# Create function
def uppercase(x):
    return x.upper()

In [70]:
# Aplly function, show two rows
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

### Applying a function to groups
Combine groupby and apply

In [71]:
##Group rows & apply functions to groups
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

### Concatenating dataframes

In [72]:
# Load library
import pandas as pd

In [73]:
 # Create dataframe
datillos = {'id':['1','2','3'],
           'first':['Kike','Marihuana','Zaratustra'],
           'last':['Tanzania', 'Sativa','Sumerio']}
df_datillos = pd.DataFrame(datillos, columns = ['id','first','last'])

In [74]:
datazos = {'id':['4','5','6'],
           'first':['Arthur','Jonh','Dutch'],
           'last':['Morgan', 'Marston','Van der Linde']}
df_datazos = pd.DataFrame(datazos, columns = ['id','first','last'])

In [75]:
# Concatenate dfs
pd.concat([df_datillos, df_datazos], axis = 0)

  id       first           last
0  1        Kike       Tanzania
1  2   Marihuana         Sativa
2  3  Zaratustra        Sumerio
0  4      Arthur         Morgan
1  5        Jonh        Marston
2  6       Dutch  Van der Linde

In [76]:
# Concatenate dfs
pd.concat([df_datillos, df_datazos], axis = 1)

  id       first      last id   first           last
0  1        Kike  Tanzania  4  Arthur         Morgan
1  2   Marihuana    Sativa  5    Jonh        Marston
2  3  Zaratustra   Sumerio  6   Dutch  Van der Linde

### Using append
Add a new row to a data frame

In [77]:
# Create a row
row = pd.Series([10,'Lionel','Messi'], index = ['id', 'first', 'last'])

In [78]:
df_datillos.append(row,ignore_index = True)

   id       first      last
0   1        Kike  Tanzania
1   2   Marihuana    Sativa
2   3  Zaratustra   Sumerio
3  10      Lionel     Messi

### Mergin dataframes

In [79]:
# Load Library
import pandas as pd

In [80]:
# Create dataframe
datoss = {'id':['1','2','3','4','5'],
           'first':['Arthur','Jonh','Dutch','Pearson', 'Javier'],
           'last':['Morgan', 'Marston','Van der Linde','Chapuzas','Garcia']}
df_datoss = pd.DataFrame(datoss, columns = ['id','first','last'])

In [81]:
# Create dataframe
extra = {'id':['3','4','5','6','7'],
           'len_pene':['999','888','000','001', '008']}
df_extra = pd.DataFrame(extra, columns = ['id','len_pene'])

In [82]:
pd.merge(df_datoss, df_extra, on='id')

  id    first           last len_pene
0  3    Dutch  Van der Linde      999
1  4  Pearson       Chapuzas      888
2  5   Javier         Garcia      000

### Outer

In [83]:
pd.merge(df_datoss, df_extra, on='id', how = 'outer')

  id    first           last len_pene
0  1   Arthur         Morgan      NaN
1  2     Jonh        Marston      NaN
2  3    Dutch  Van der Linde      999
3  4  Pearson       Chapuzas      888
4  5   Javier         Garcia      000
5  6      NaN            NaN      001
6  7      NaN            NaN      008

### Left

In [84]:
pd.merge(df_datoss, df_extra, on='id', how='left')

  id    first           last len_pene
0  1   Arthur         Morgan      NaN
1  2     Jonh        Marston      NaN
2  3    Dutch  Van der Linde      999
3  4  Pearson       Chapuzas      888
4  5   Javier         Garcia      000

### Right

In [85]:
pd.merge(df_datoss, df_extra, on='id', how = 'right')

  id    first           last len_pene
0  3    Dutch  Van der Linde      999
1  4  Pearson       Chapuzas      888
2  5   Javier         Garcia      000
3  6      NaN            NaN      001
4  7      NaN            NaN      008

### MIX

In [91]:
pd.merge(df_datoss, df_extra, left_on='id', right_on='id')

  id    first           last len_pene
0  3    Dutch  Van der Linde      999
1  4  Pearson       Chapuzas      888
2  5   Javier         Garcia      000